РП/src/DataProcessors/ПомощникВоинскогоУчета/ПомощникВоинскогоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникВоинскогоУчета</name>
</mdclass:DataProcessor>

РП/src/Documents/ЛистокСообщенияДляВоенкомата/ЛистокСообщенияДляВоенкомата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистокСообщенияДляВоенкомата</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <basedOn>Document.КадровыйПеревод</basedOn>
  <basedOn>Document.ПриемНаРаботу</basedOn>
  <basedOn>Document.Увольнение</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЛистковСообщения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВрученияСотруднику</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНевручения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИзменений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>350</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <comment>Дата рождения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Образование</name>
    <type>
      <types>CatalogRef.ВидыОбразованияФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>СемейноеПоложение</name>
    <type>
      <types>CatalogRef.СостояниеВБраке</types>
    </type>
  </attributes>
  <attributes>
    <name>Звание</name>
    <type>
      <types>CatalogRef.ЗванияГражданскогоВоинскогоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВУС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗдоровья</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаПроживанияПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоставСемьи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаВУР</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.КадровыйПеревод</types>
      <types>DocumentRef.Увольнение</types>
      <types>DocumentRef.КадровыйПереводСписком</types>
      <types>DocumentRef.ПриемНаРаботу</types>
      <types>DocumentRef.УвольнениеСписком</types>
      <types>DocumentRef.ПриемНаРаботуСписком</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПоПропискеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ФиксацияИзменений</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Путь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РП/src/DataProcessors/ПомощникВоинскогоУчета/Forms/Форма/Module.bsl
&НаКлиенте
Перем ОткрытыеФормы Экспорт;

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    НастройкаВидВсеСотрудники = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Сотрудники", "ВидВсеСотрудники");
	ВидВсеСотрудники = ?(НастройкаВидВсеСотрудники = Неопределено, Истина, НастройкаВидВсеСотрудники);
	
	НастройкаСотрудникиПодробноКадровые =  ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Сотрудники", "СотрудникиПодробноКадровые");
	СотрудникиПодробноКадровые = ?(СотрудникиПодробноКадровые = Неопределено, Ложь, СотрудникиПодробноКадровые); 
	
	ПоказыватьСотрудниковПодчиненныхПодразделений = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Сотрудники", "ПоказыватьСотрудниковПодчиненныхПодразделений");
	Если ПоказыватьСотрудниковПодчиненныхПодразделений <> Неопределено Тогда
		Элементы.ПодразделенияКонтекстноеМенюПоказыватьСотрудниковПодчиненныхПодразделений.Пометка = ПоказыватьСотрудниковПодчиненныхПодразделений;
	КонецЕсли;

	ЗначенияДляЗаполнения  = Новый Структура("Организация", "Организация");
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ЗарплатаКадры.ПерваяДоступнаяОрганизация();
	КонецЕсли;
	
	УстановитьВидСпискаСотрудников(ЭтаФорма);
	УстановитьСотрудникиПодробноКадровые(ЭтаФорма);
	УстановитьДанныеПоОрганизации(Ложь);
	
//++ ЕРП ЗИК	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать
//~	// СтандартныеПодсистемы.ПодключаемыеКоманды
//~	ТипыДокументовБронь = БронированиеГражданПребывающихВЗапасе.КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Ссылка")).Тип;
//~	
//~	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
//~	ПараметрыРазмещения.Источники = Новый ОписаниеТипов(ТипыДокументовБронь);
//~	ПараметрыРазмещения.КоманднаяПанель = Элементы.БронированиеГражданПребывающихВЗапасеКонтекстноеМеню;
//~	ПараметрыРазмещения.ПрефиксГрупп = "БронированиеГражданПребывающихВЗапасе";
//~	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
//~	
//~	ТипыДокументовЛисток = ЛистокСообщенияДляВоенкомата.КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Ссылка")).Тип;
//~
//~	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
//~	ПараметрыРазмещения.Источники = Новый ОписаниеТипов(ТипыДокументовЛисток);
//~	ПараметрыРазмещения.КоманднаяПанель = Элементы.ЛистокСообщенияДляВоенкоматаКонтекстноеМеню;
//~	ПараметрыРазмещения.ПрефиксГрупп = "ЛистокСообщенияДляВоенкомата";
//~	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
//~	// СтандартныеПодсистемы.ПодключаемыеКоманды
//-- ЕРП ЗИК	
	
КонецПроцедуры

//++ ЕРП ЗИК

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	Если СтрНайти(Команда.Имя,"ЛистокСообщенияДляВоенкоматаКонтекстноеМеню")>0 Тогда
		УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Элементы.ЛистокСообщенияДляВоенкомата);
	ИначеЕсли СтрНайти(Команда.Имя,"БронированиеГражданПребывающихВЗапасеКонтекстноеМеню")>0 Тогда
		УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Элементы.БронированиеГражданПребывающихВЗапасе);
	КонецЕсли;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

//-- ЕРП ЗИК

&НаКлиенте
Процедура БронированиеГражданПребывающихВЗапасеПриАктивизацииСтроки(Элемент)
	
//++ ЕРП ЗИК	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьКоманды", 0.1, Истина);
//~	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
//-- ЕРП ЗИК
	
КонецПроцедуры

&НаКлиенте
Процедура ЛистокСообщенияДляВоенкоматаПриАктивизацииСтроки(Элемент)

//++ ЕРП ЗИК	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьКоманды", 0.1, Истина);
//~	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
//-- ЕРП ЗИК	
	
КонецПроцедуры

//++ ЕРП ЗИК
//~&НаКлиенте
//~Процедура Подключаемый_ВыполнитьКоманду(Команда)
//~	
//~	Если ЭтотОбъект.ТекущийЭлемент.Имя = "БронированиеГражданПребывающихВЗапасе" Тогда
//~		ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.БронированиеГражданПребывающихВЗапасе);
//~	ИначеЕсли ЭтотОбъект.ТекущийЭлемент.Имя = "ЛистокСообщенияДляВоенкомата" Тогда
//~		ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.ЛистокСообщенияДляВоенкомата);
//~	Конецесли;
//~КонецПроцедуры
//~
//~&НаСервере
//~Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
//~	
//~	Если ЭтотОбъект.ТекущийЭлемент.Имя = "БронированиеГражданПребывающихВЗапасе" Тогда
//~		
//~		ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.БронированиеГражданПребывающихВЗапасе, Результат);
//~		
//~	ИначеЕсли ЭтотОбъект.ТекущийЭлемент.Имя = "ЛистокСообщенияДляВоенкомата" Тогда
//~		
//~		ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.ЛистокСообщенияДляВоенкомата, Результат);
//~		
//~	КонецЕсли;
//~КонецПроцедуры
//-- ЕРП ЗИК

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()

//++ ЕРП ЗИК	
	ОбновитьКоманды(Элементы.ЛистокСообщенияДляВоенкомата);
	ОбновитьКоманды(Элементы.БронированиеГражданПребывающихВЗапасе);
//~	Если ЭтотОбъект.ТекущийЭлемент.Имя = "БронированиеГражданПребывающихВЗапасе" Тогда
//~		
//~		ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.БронированиеГражданПребывающихВЗапасе);
//~		
//~	ИначеЕсли ЭтотОбъект.ТекущийЭлемент.Имя = "ЛистокСообщенияДляВоенкомата" Тогда
//~		
//~		ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.ЛистокСообщенияДляВоенкомата);
//~		
//~	КонецЕсли;
//-- ЕРП ЗИК	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "ИзмененыДанныеДополнительнойФормы" И Источник = ЭтаФорма) Тогда
		
		ПрочитатьДанныеИзХранилищаВФормуНаСервере(Параметр);
		СохранитьДанныеДополнительнойФормы(Параметр, Ложь);
		
		ОбновитьСписки(ЭтаФорма, Истина, Ложь);
		
	Конецесли;
	
	Если ИмяСобытия = "ИзменениеДанныхФизическогоЛица" 
		Тогда
		
		ОбновитьСписки(ЭтаФорма, Истина, Ложь);
		
	ИначеЕсли ИмяСобытия = "ИзменениеДанныхМестаРаботы" 
		Тогда
		
		ОбновитьСписки(ЭтаФорма, Истина, Истина);
		
	КонецЕсли; 
	
КонецПроцедуры
#КонецОбласти

&НаСервере
Процедура УстановитьОтборПоДате()
	
	ТекущаяРабочаяДата = ОбщегоНазначения.ТекущаяДатаПользователя();
	
	ДатаОкончания = КонецДня(ТекущаяРабочаяДата);
	ДатаНачала = НачалоДня(ДатаОкончания);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Сотрудники, "ДатаНачала", '00010101', Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Сотрудники, "ДатаНачалаСведений", ДатаНачала, Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Сотрудники, "ДатаОкончания", ДатаОкончания, Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Подразделения, "ДатаОкончания", ДатаОкончания, Истина);
		
	//слова виводу в таблиці співробітники
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Сотрудники, "Забронирован", НСтр("ru='Забронировано в ';uk='Заброньовано в '"), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Сотрудники, "ОтменаБрони", НСтр("ru='Отмена брони в ';uk='Скасування броні в '"), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Сотрудники, "НетДанных", НСтр("ru='Нет данных';uk='Немає даних'"), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Сотрудники, "Нужнозаполнить", НСтр("ru='Нужно заполнить';uk='Потрібно заповнити'"), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Сотрудники, "НеУказанаОтстрочка", НСтр("ru='Не указана отстрочка';uk='Не вказана відстрочка'"), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Сотрудники, "НеПодлежитБронированию", НСтр("ru='Не подлежит бронированию';uk='Не підлягає бронюванню'"), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Сотрудники, "ЗабронированСторОрг", НСтр("ru='Бронь в стор. организации';uk='Бронь у стор. організації'"), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Сотрудники, "Небронировался", НСтр("ru='Не бронировался';uk='Не бронювався'"), Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиФормы()
	
	НастройкиСписка = СотрудникиФормыРасширенный.НастройкиСпискаФормы(ЭтаФорма, "Сотрудники");
	СотрудникиФормыРасширенный.ПрименитьНастройкиСписка(ЭтаФорма, НастройкиСписка, "Сотрудники", , Организация);
	УстановитьОтборПоДате();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СотрудникиКонтекстноеМенюУпорядочитьПоВажностиЗанимаемойДолжности",
		"Пометка",
		ПорядокПоВажностиУстановлен(ЭтаФорма));
	
	КонецПроцедуры
	
&НаСервере
Процедура УстановитьОтборВСписках(ОбновитьНастройки)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Сотрудники, "Подразделение");
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Сотрудники, "Организация", Организация);
		УстановитьОтборПоФилиалу(ЭтаФорма, Организация);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(БронированиеГражданПребывающихВЗапасе, "Организация", Организация);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КадровыеДокументыБезЛистков, "Организация", Организация);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Сотрудники, "Организация");
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Сотрудники, "ОтборПоФилиалуИЛИ");
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(БронированиеГражданПребывающихВЗапасе, "Организация");
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(КадровыеДокументыБезЛистков, "Организация");
		
	КонецЕсли;
	
	Если ОбновитьНастройки Тогда
		
		ОбновитьНастройкиФормы();
		
	КонецЕсли;
	
КонецПроцедуры

//++ ЕРП ЗИК
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьКоманды(Источник)
	
	Если Источник.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник.ТекущаяСтрока) = Тип("ДокументСсылка.БронированиеГражданПребывающихВЗапасе") Тогда
		ДоступностьКомнады = Истина;
	Иначе
		ДоступностьКомнады = Ложь;
	Конецесли;
	
	Если Источник.КонтекстноеМеню.Имя = "БронированиеГражданПребывающихВЗапасеКонтекстноеМеню" Тогда
		Для Каждого ИмяКнопкиИлиПодменю Из Источник.КонтекстноеМеню.ПодчиненныеЭлементы Цикл
			Если СтрНайти(ИмяКнопкиИлиПодменю.Имя, "МенюКомандаПечати") > 0 Тогда
				ИмяКнопкиИлиПодменю.Доступность = ДоступностьКомнады;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
//-- ЕРП ЗИК

&НаСервере
Процедура УстановитьДанныеПоОрганизации(ОбновитьНастройки = Истина)
	
	УстановитьОтборВСписках(ОбновитьНастройки);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиПользователя", "Организация", Организация);
	УстановитьДанныеПоОрганизации();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПодразделенияПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьОтборПоПодразделениюНаКлиенте", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьОтборПоСотрудникуНаКлиенте", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеИзХранилищаВФормуНаСервере(Параметр) Экспорт
	
	СотрудникиФормы.ПрочитатьДанныеИзХранилищаВФорму(
		ЭтаФорма,
		СотрудникиКлиентСервер.ОписаниеДополнительнойФормы(Параметр.ИмяФормы),
		Параметр.АдресВХранилище);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеДополнительнойФормы(Параметр, Отказ) Экспорт
	
	СотрудникиФормы.СохранитьДанныеДополнительнойФормы(ЭтаФорма, Параметр.ИмяФормы, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	ОбновитьНастройкиФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СотрудникиПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПодразделениюНаКлиенте()
	
	УстановитьОтборПоПодразделениюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоСотрудникуНаКлиенте()
	
	УстановитьОтборПоСотрудникуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПодразделениюНаСервере()
	
	УстановитьОтборПоПодразделению(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПОСотрудникуНаСервере()
	
	УстановитьОтборПоСотруднику(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСотрудниковНаСервере()
	
	УстановитьОтборПоДате();
	Элементы.Сотрудники.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКадровыеИЛисткиНаСервере()
	
	Элементы.КадровыеДокументыБезЛистков.Обновить();
	Элементы.ЛистокСообщенияДляВоенкомата.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиПоказыватьСотрудниковПодчиненныхПодразделений()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Сотрудники", "ПоказыватьСотрудниковПодчиненныхПодразделений",
		Элементы.ПодразделенияКонтекстноеМенюПоказыватьСотрудниковПодчиненныхПодразделений.Пометка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиУпорядочиванияСотрудников()
	
	Элементы.СотрудникиКонтекстноеМенюУпорядочитьПоВажностиЗанимаемойДолжности.Пометка
		= Не Элементы.СотрудникиКонтекстноеМенюУпорядочитьПоВажностиЗанимаемойДолжности.Пометка;
	
	УстановитьСортировкуСписка();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСортировкуСписка()
	
	УстановитьСортировку = Элементы.СотрудникиКонтекстноеМенюУпорядочитьПоВажностиЗанимаемойДолжности.Пометка;
	
	ПолеПодразделения = Новый ПолеКомпоновкиДанных("ПорядокПодразделения");
	ПолеДолжности = Новый ПолеКомпоновкиДанных("ПорядокДолжности");
	
	КоллекцияЭлементовПорядка = КоллекцияЭлементовПорядкаСпискаСотрудники(ЭтаФорма);
	СортировкаУстановлена = ПорядокПоВажностиУстановлен(ЭтаФорма);
	
	Если УстановитьСортировку Тогда
		
		Если СортировкаУстановлена Тогда
			
			КоллекцияЭлементовПорядка.Элементы.Получить(0).Использование = Истина;
			КоллекцияЭлементовПорядка.Элементы.Получить(1).Использование = Истина;
			
		Иначе
			
			ЭлементПорядка = КоллекцияЭлементовПорядка.Элементы.Вставить(0, Тип("ЭлементПорядкаКомпоновкиДанных"));
			ЭлементПорядка.Поле = ПолеДолжности;
			ЭлементПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
			
			ЭлементПорядка = КоллекцияЭлементовПорядка.Элементы.Вставить(0, Тип("ЭлементПорядкаКомпоновкиДанных"));
			ЭлементПорядка.Поле = ПолеПодразделения;
			ЭлементПорядка.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
			
		КонецЕсли;
		
	ИначеЕсли СортировкаУстановлена Тогда
		
		КоллекцияЭлементовПорядка.Элементы.Удалить(КоллекцияЭлементовПорядка.Элементы.Получить(0));
		КоллекцияЭлементовПорядка.Элементы.Удалить(КоллекцияЭлементовПорядка.Элементы.Получить(0));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСотрудников(Команда)
	
	ОбновитьСотрудниковНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеСотрудники(Команда)
	
	ВидВсеСотрудники = Истина;
	УстановитьВидСпискаСотрудников(ЭтаФорма);
	УстановитьОтборПоПодразделению(ЭтаФорма);
	
	ПодключитьОбработчикОжидания("ПриИзмененииСохраняемойНастройки", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПоПодразделениям(Команда)
	
	ВидВсеСотрудники = Ложь;
	УстановитьВидСпискаСотрудников(ЭтаФорма);
	УстановитьОтборПоПодразделению(ЭтаФорма);
	
	ПодключитьОбработчикОжидания("ПриИзмененииСохраняемойНастройки", 0.2, Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииСохраняемойНастройки()
	
	Настройки = СохраняемыеНастройки();
	Настройки.ВидВсеСотрудники = ВидВсеСотрудники;
	СохранитьНастройкиНаСервере(Настройки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СохраняемыеНастройки()
	
	Настройки = Новый Структура("ВидВсеСотрудники");
	Возврат Настройки;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкиНаСервере(Настройки)
	
	Для Каждого КлючИЗначение Из Настройки Цикл
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Сотрудники", КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПорядокПоВажностиУстановлен(Форма)
	
	КоллекцияЭлементовПорядка = КоллекцияЭлементовПорядкаСпискаСотрудники(Форма);
	
	ПорядокУстановлен = Ложь;
	Если КоллекцияЭлементовПорядка.Элементы.Количество() > 1 Тогда
		
		ПолеПодразделения = Новый ПолеКомпоновкиДанных("ПорядокПодразделения");
		ПолеДолжности = Новый ПолеКомпоновкиДанных("ПорядокДолжности");
		
		Если КоллекцияЭлементовПорядка.Элементы.Получить(0).Поле = ПолеПодразделения
			И КоллекцияЭлементовПорядка.Элементы.Получить(1).Поле = ПолеДолжности Тогда
			
			ПорядокУстановлен = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПорядокУстановлен;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КоллекцияЭлементовПорядкаСпискаСотрудники(Форма)
	
	Сотрудники = Форма.Сотрудники;
	
	КоллекцияЭлементовПорядка = Неопределено;
	Для Каждого КоллекцияЭлементовНастроек Из Сотрудники.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		
		Если ТипЗнч(КоллекцияЭлементовНастроек) = Тип("ПорядокКомпоновкиДанных") Тогда
			КоллекцияЭлементовПорядка = КоллекцияЭлементовНастроек;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоллекцияЭлементовПорядка = Неопределено Тогда
		КоллекцияЭлементовПорядка = Сотрудники.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Добавить();
	КонецЕсли;
	
	Возврат КоллекцияЭлементовПорядка;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоФилиалу(Форма, Филиал)
	
	Сотрудники = Форма.Сотрудники;
	
	УстановитьОтборПустогоФилиала = Ложь;
	ГруппаОтбораИли = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(Сотрудники.Отбор.Элементы, "ОтборПоФилиалуИЛИ");
	Если ГруппаОтбораИли = Неопределено Тогда
		
		ГруппаОтбораИли = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Сотрудники.Отбор.Элементы, "ОтборПоФилиалуИЛИ", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		УстановитьОтборПустогоФилиала = Истина;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбораИли, "Филиал", Филиал, ВидСравненияКомпоновкиДанных.Равно, "ОтборПоФилиалу");
		
	Иначе
		
		ОтборПоФилиалу = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(ГруппаОтбораИли.Элементы, "ОтборПоФилиалу");
		ОтборПоФилиалу.ПравоеЗначение = Филиал;
		
	КонецЕсли;
	
	Если УстановитьОтборПустогоФилиала Тогда
		
		ГруппаОтбораПустогоФилиала = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаОтбораИли, "ОтборПустогоФилиала", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбораПустогоФилиала, "Филиал", Филиал, ВидСравненияКомпоновкиДанных.НеЗаполнено, "ОтборНеПринятых");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоПодразделению(Форма)
	
	Если Форма.Элементы.Подразделения.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ВидВсеСотрудники Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
			Форма.Сотрудники, "Подразделение");
		
		УстановитьОтборПоФилиалу(Форма, Форма.Организация);
		
	Иначе
		
		Если ТипЗнч(Форма.Элементы.Подразделения.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			ОтборПоФилиалу = Форма.Элементы.Подразделения.ТекущаяСтрока.Ключ;
		ИначеЕсли ТипЗнч(Форма.Элементы.Подразделения.ТекущаяСтрока) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
				ОтборПоФилиалу = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Элементы.Подразделения.ТекущаяСтрока, "Владелец");
			#Иначе
				
				Если Форма.Элементы.Подразделения.ТекущиеДанные <> Неопределено Тогда
					ОтборПоФилиалу = Форма.Элементы.Подразделения.ТекущиеДанные.Владелец;
				Иначе
					ОтборПоФилиалу = Неопределено;
				КонецЕсли;
				
			#КонецЕсли
			
		Иначе
			ОтборПоФилиалу = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтборПоФилиалу) Тогда
			УстановитьОтборПоФилиалу(Форма, ОтборПоФилиалу);
		Иначе
			УстановитьОтборПоФилиалу(Форма, Форма.Организация);
		КонецЕсли;
		
		Если ТипЗнч(Форма.Элементы.Подразделения.ТекущаяСтрока) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			
			Если Форма.Элементы.ПодразделенияКонтекстноеМенюПоказыватьСотрудниковПодчиненныхПодразделений.Пометка Тогда
				ВидСравненияПоПодразделению = ВидСравненияКомпоновкиДанных.ВИерархии;
			Иначе
				ВидСравненияПоПодразделению = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				Форма.Сотрудники.Отбор, "Подразделение", Форма.Элементы.Подразделения.ТекущаяСтрока, ВидСравненияПоПодразделению);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Форма.Сотрудники.Отбор, "Подразделение");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоСотруднику(Форма)
	// рв "Військовий оілік"
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
			Форма.ВоинскийУчетРС, "ФизическоеЛицо");
			
	// дин. список журнал броюнвання
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
			Форма.БронированиеГражданПребывающихВЗапасе, "ФизическоеЛицо");
			
	// дин. список док. Листок		
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
			Форма.ЛистокСообщенияДляВоенкомата, "Сотрудник");
			
	// дин. список кадрові док-и
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
			Форма.КадровыеДокументыБезЛистков, "ФизическоеЛицо");
			
	Если Форма.Элементы.Сотрудники.ТекущаяСтрока = Неопределено Тогда
		
		Возврат;
		
	Иначе
	
		// відбір для регістру відомостей "Військовий оілік" по фіз. особі
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.ВоинскийУчетРС, "ФизическоеЛицо", Форма.Элементы.Сотрудники.ТекущаяСтрока.ФизическоеЛицо);
		
		// відбір для журналу документів "бронювання" по фіз.особі
		Форма.БронированиеГражданПребывающихВЗапасе.ТекстЗапроса =
			"ВЫБРАТЬ
			|	ЖурналДокументовБронированиеГражданПребывающихВЗапасе.Ссылка,
			|	ЖурналДокументовБронированиеГражданПребывающихВЗапасе.Дата,
			|	ЖурналДокументовБронированиеГражданПребывающихВЗапасе.ПометкаУдаления,
			|	ЖурналДокументовБронированиеГражданПребывающихВЗапасе.Номер,
			|	ЖурналДокументовБронированиеГражданПребывающихВЗапасе.Проведен,
			|	ЖурналДокументовБронированиеГражданПребывающихВЗапасе.Организация,
			|	ЖурналДокументовБронированиеГражданПребывающихВЗапасе.Сотрудники,
			|	ЖурналДокументовБронированиеГражданПребывающихВЗапасе.Ответственный,
			|	ЖурналДокументовБронированиеГражданПребывающихВЗапасе.Комментарий,
			|	ЖурналДокументовБронированиеГражданПребывающихВЗапасе.Тип
			|ИЗ
			|	КритерийОтбора.ДокументыСотрудников(&ФизическоеЛицо) КАК ДокументыСотрудников
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЖурналДокументов.БронированиеГражданПребывающихВЗапасе КАК ЖурналДокументовБронированиеГражданПребывающихВЗапасе
			|		ПО ДокументыСотрудников.Ссылка = ЖурналДокументовБронированиеГражданПребывающихВЗапасе.Ссылка";
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.БронированиеГражданПребывающихВЗапасе, "ФизическоеЛицо", Форма.Элементы.Сотрудники.ТекущаяСтрока.ФизическоеЛицо, Истина);
		
		 //відбір для документу "листки сповіщення в воєнкомат" по фіз.особі
		Форма.ЛистокСообщенияДляВоенкомата.ТекстЗапроса =
		    "ВЫБРАТЬ
			|	ДокументЛистокСообщенияДляВоенкомата.Ссылка,
			|	ДокументЛистокСообщенияДляВоенкомата.ПометкаУдаления,
			|	ДокументЛистокСообщенияДляВоенкомата.Номер,
			|	ДокументЛистокСообщенияДляВоенкомата.Дата,
			|	ДокументЛистокСообщенияДляВоенкомата.Проведен,
			|	ДокументЛистокСообщенияДляВоенкомата.Организация,
			|	ДокументЛистокСообщенияДляВоенкомата.Сотрудник,
			|	ДокументЛистокСообщенияДляВоенкомата.Статус,
			|	ДокументЛистокСообщенияДляВоенкомата.ДатаВрученияСотруднику,
			|	ДокументЛистокСообщенияДляВоенкомата.ПричинаНевручения,
			|	ДокументЛистокСообщенияДляВоенкомата.ОписаниеИзменений,
			|	ДокументЛистокСообщенияДляВоенкомата.Ответственный,
			|	ДокументЛистокСообщенияДляВоенкомата.Комментарий,
			|	ДокументЛистокСообщенияДляВоенкомата.ДокументОснование,
			|	ДокументЛистокСообщенияДляВоенкомата.Основание
			|ИЗ
		    |	Документ.ЛистокСообщенияДляВоенкомата КАК ДокументЛистокСообщенияДляВоенкомата
		    |ГДЕ
		    |	ДокументЛистокСообщенияДляВоенкомата.Сотрудник.ФизическоеЛицо = &ФизическоеЛицо";
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.ЛистокСообщенияДляВоенкомата, "ФизическоеЛицо", Форма.Элементы.Сотрудники.ТекущаяСтрока.ФизическоеЛицо, Истина);
			
			Форма.КадровыеДокументыБезЛистков.ТекстЗапроса =
			   "ВЫБРАТЬ
			   |	ЖурналДокументовПриемыПереводыУвольнения.Ссылка КАК Ссылка,
			   |	ЖурналДокументовПриемыПереводыУвольнения.Дата КАК Дата,
			   |	ЖурналДокументовПриемыПереводыУвольнения.ПометкаУдаления КАК ПометкаУдаления,
			   |	ЖурналДокументовПриемыПереводыУвольнения.Номер КАК Номер,
			   |	ЖурналДокументовПриемыПереводыУвольнения.Проведен КАК Проведен,
			   |	ЖурналДокументовПриемыПереводыУвольнения.Организация КАК Организация,
			   |	ЖурналДокументовПриемыПереводыУвольнения.Сотрудник КАК Сотрудник,
			   |	ЖурналДокументовПриемыПереводыУвольнения.ДатаСобытия КАК ДатаСобытия,
			   |	ЖурналДокументовПриемыПереводыУвольнения.Утвержден КАК Утвержден,
			   |	ЖурналДокументовПриемыПереводыУвольнения.Ответственный КАК Ответственный,
			   |	ЖурналДокументовПриемыПереводыУвольнения.Комментарий КАК Комментарий,
			   |	ЖурналДокументовПриемыПереводыУвольнения.Тип КАК Тип,
			   |	ЛистокСообщенияДляВоенкомата.ДокументОснование КАК ДокументОснование
			   |ИЗ
			   |	КритерийОтбора.ДокументыСотрудников(&ФизическоеЛицо) КАК ДокументыСотрудников
			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЖурналДокументов.ПриемыПереводыУвольнения КАК ЖурналДокументовПриемыПереводыУвольнения
			   |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистокСообщенияДляВоенкомата КАК ЛистокСообщенияДляВоенкомата
			   |			ПО ЖурналДокументовПриемыПереводыУвольнения.Ссылка = ЛистокСообщенияДляВоенкомата.ДокументОснование
			   |		ПО ДокументыСотрудников.Ссылка = ЖурналДокументовПриемыПереводыУвольнения.Ссылка
			   |ГДЕ
			   |	(ЖурналДокументовПриемыПереводыУвольнения.Тип = ТИП(Документ.ПриемНаРаботу)
			   |			ИЛИ ЖурналДокументовПриемыПереводыУвольнения.Тип = ТИП(Документ.ПриемНаРаботуСписком)
			   |			ИЛИ ЖурналДокументовПриемыПереводыУвольнения.Тип = ТИП(Документ.КадровыйПеревод)
			   |			ИЛИ ЖурналДокументовПриемыПереводыУвольнения.Тип = ТИП(Документ.КадровыйПереводСписком)
			   |			ИЛИ ЖурналДокументовПриемыПереводыУвольнения.Тип = ТИП(Документ.УвольнениеСписком)
			   |			ИЛИ ЖурналДокументовПриемыПереводыУвольнения.Тип = ТИП(Документ.Увольнение))
			   |			И ЕСТЬNULL(ЛистокСообщенияДляВоенкомата.ДокументОснование,ИСТИНА) = ИСТИНА";
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.КадровыеДокументыБезЛистков, "ФизическоеЛицо", Форма.Элементы.Сотрудники.ТекущаяСтрока.ФизическоеЛицо, Истина);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидСпискаСотрудников(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Подразделения",
		"Видимость",
		Не Форма.ВидВсеСотрудники);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СотрудникиПодразделениеСписка",
		"Видимость",
		Форма.ВидВсеСотрудники);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ВсеСотрудники",
		"Пометка",
		Форма.ВидВсеСотрудники);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СотрудникиПоПодразделениям",
		"Пометка",
		Не Форма.ВидВсеСотрудники);
	
КонецПроцедуры
	
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСотрудникиПодробноКадровые(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СотрудникиКадровыеДанные",
		"Видимость",
		Форма.СотрудникиПодробноКадровые);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСписки(Форма, СпискиСотрудников, СпискиДокументов)
	
	Если  СпискиСотрудников Тогда
		
		Форма.Элементы.Сотрудники.Обновить();
		Форма.Элементы.ВоинскийУчетРС.Обновить();
		Форма.Элементы.Подразделения.Обновить();
		
	КонецЕсли;
	
	Если СпискиДокументов Тогда
		
		Форма.Элементы.БронированиеГражданПребывающихВЗапасе.Обновить();
		Форма.Элементы.ЛистокСообщенияДляВоенкомата.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьСотрудниковПодчиненныхПодразделений(Команда)
	
	Элементы.ПодразделенияКонтекстноеМенюПоказыватьСотрудниковПодчиненныхПодразделений.Пометка =
		Не Элементы.ПодразделенияКонтекстноеМенюПоказыватьСотрудниковПодчиненныхПодразделений.Пометка;
	
	УстановитьОтборПоПодразделению(ЭтаФорма);
	СохранитьНастройкиПоказыватьСотрудниковПодчиненныхПодразделений();
	
КонецПроцедуры  

&НаКлиенте
Процедура УпорядочитьПоВажностиЗанимаемойДолжности(Команда)
	
	УстановитьНастройкиУпорядочиванияСотрудников();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСотрудникиПодробноКадровые(Команда)
	
	СотрудникиПодробноКадровые = Не СотрудникиПодробноКадровые;
	УстановитьСотрудникиПодробноКадровые(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ФизическоеЛицоСсылка = Элемент.ТекущиеДанные.ФизическоеЛицо;
	ВоинскийУчетПрежняя = Неопределено;
	ОткрытьДополнительнуюФормуВО(
		СотрудникиКлиентСервер.ОписаниеДополнительнойФормы("Справочник.ФизическиеЛица.Форма.ВоинскийУчет"), Элемент.ТекущиеДанные);

	КонецПроцедуры
	
&НаКлиенте
Процедура СотрудникиПриИзменении(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	ФизическоеЛицоСсылка = Элемент.ТекущиеДанные.ФизическоеЛицо;
	ВоинскийУчетПрежняя = Неопределено;
	ОткрытьДополнительнуюФормуВО(
		СотрудникиКлиентСервер.ОписаниеДополнительнойФормы("Справочник.ФизическиеЛица.Форма.ВоинскийУчет"), Элемент.ТекущиеДанные);

	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДополнительнуюФормуВО(ОписаниеДополнительнойФормы, Форма) Экспорт
	
	ПараметрыФормы = ПараметрыДополнительнойФормыВО(ОписаниеДополнительнойФормы, Форма);
	ОткрытьФорму(ОписаниеДополнительнойФормы.ИмяФормы, ПараметрыФормы, ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыДополнительнойФормыВО(ОписаниеДополнительнойФормы, Форма)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресВХранилище", "");
	ПараметрыФормы.Вставить("ФизическоеЛицоСсылка", Форма.ФизическоеЛицо);
	ПараметрыФормы.Вставить("Заголовок", Форма.НаименованиеСотрудника);
	
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ПараметрыФормы.Вставить(
		"АдресВХранилище",
		АдресДанныхДополнительнойФормыНаСервере(ОписаниеДополнительнойФормы));
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервере
Функция АдресДанныхДополнительнойФормыНаСервере(ОписаниеДополнительнойФормы) Экспорт
	
	Возврат СотрудникиФормы.АдресДанныхДополнительнойФормы(ОписаниеДополнительнойФормы, ЭтаФорма);
	
КонецФункции

&НаКлиенте
Процедура БронированиеГражданПребывающихВЗапасеПриИзменении(Элемент)
	
	ОбновитьСотрудниковНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛистокСообщенияДляВоенкомата(Команда)
  
	Если Элементы.Сотрудники.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Если Элементы.КадровыеДокументыБезЛистков.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
  
	Ссылка = Элементы.КадровыеДокументыБезЛистков.ТекущиеДанные.Ссылка;
	
	Сотрудник = Элементы.Сотрудники.ТекущиеДанные.Ссылка; 
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПриемНаРаботу") 
			ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.КадровыйПеревод") 
			ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.Увольнение")
			Тогда
		
		ПараметрыФормы = Новый Структура("Основание, Сотрудник", Ссылка,Сотрудник);
		ОткрытьФорму("Документ.ЛистокСообщенияДляВоенкомата.ФормаОбъекта", ПараметрыФормы);
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПриемНаРаботуСписком") 
				ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.КадровыйПереводСписком") 
				ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.УвольнениеСписком")
				Тогда
				
		ПараметрыФормы = Новый Структура("ОснованиеСписком, Сотрудник", Ссылка, Сотрудник);
		ОткрытьФорму("Документ.ЛистокСообщенияДляВоенкомата.ФормаОбъекта", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КадровыеДокументыБезЛистковПриИзменении(Элемент)
	
	УстановитьОтборВСписках(Истина);
	ОбновитьКадровыеИЛисткиНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ЛистокСообщенияДляВоенкоматаПриИзменении(Элемент)
	
	УстановитьОтборВСписках(Истина);
	ОбновитьКадровыеИЛисткиНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВоинскийУчетРСПриИзменении(Элемент)
	
	ОбновитьСписки(ЭтаФорма, Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура АнализКарточекВоинскогоУчета(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", "АнализКарточекВоинскогоУчета");
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Организация", Организация));
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.ВоинскийУчетОбщий.Форма", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СпискиПерсональногоВоинскогоУчета(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", "СпискиПерсональногоВоинскогоУчета");
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Организация", Организация));
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.СпискиПерсональногоВоинскогоУчета.Форма", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура СписокПодлежащихПрипискеКПризывнымУчасткам(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", "СписокПодлежащихПрипискеКПризывнымУчасткам");
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Организация", Организация));
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.ВоинскийУчетОбщий.Форма", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомостьОперативногоУчетаВоеннообязанных(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", "ВедомостьОперативногоУчетаВоеннообязанных");
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Организация", Организация));
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.ВоинскийУчетБронирование.Форма", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЛичныеДанныеСотрудника(Команда)
	
	Если Элементы.Сотрудники.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Элементы.Сотрудники.ТекущаяСтрока) Тогда
		ПараметрыФормы = Новый Структура("Ключ", Элементы.Сотрудники.ТекущиеДанные.ФизическоеЛицо);
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры
